leitek/sw/houyi/keil/stm32f103/Utilities/GUI/ARC_uCGUI_FreeRTOS.c
/**
  ******************************************************************************
  * @file    LTK_uCGUI_FreeRTOS.c
  * @author  leitek (leitek.taobao.com)
  * @version V1.0.0
  * @brief   LTK middleware. 
  *          This file provides ADC middleware functions.
  ******************************************************************************
  * @copy
  *
  * For non-commercial research and private study only.
  *
  * COPYRIGHT leitek.taobao.com
  */ 

  
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "GUI_Private.h"
#include "LTK_SysTick.h"
#include <stdio.h>


/** @addtogroup Utilities
  * @{
  */ 

/** @addtogroup LTK_UCGUI_FREERTOS
  * @{
  */ 

/** @defgroup LTK_UCGUI_FREERTOS_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup LTK_UCGUI_FREERTOS_Private_Defines
  * @{
  */

/**
  * @}
  */ 

/** @defgroup LTK_UCGUI_FREERTOS_Private_Macros
  * @{
  */ 

/**
  * @}
  */ 

/** @defgroup LTK_UCGUI_FREERTOS_Private_Variables
  * @{
  */ 

/**
  * @}
  */

/** @defgroup LTK_UCGUI_FREERTOS_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup LTK_UCGUI_FREERTOS_Private_Functions
  * @{
  */
  
#include "FreeRTOS.h"
#include "GUI_Private.H"
#include <stdio.h>

/*
*********************************************************************************************************
*                                         GLOBAL VARIABLES
*********************************************************************************************************
*/
static xSemaphoreHandle dispSem;
static xSemaphoreHandle dispBinarySem;

/*
*********************************************************************************************************
*                                        TIMING FUNCTIONS
*
* Notes: Some timing dependent routines of uC/GUI require a GetTime and delay funtion. 
*        Default time unit (tick), normally is 1 ms.
*********************************************************************************************************
*/

int  GUI_X_GetTime (void) 
{
    return ((int)xTaskGetTickCount());
}


void  GUI_X_Delay (int period) 
{
    LTK_SysTick_Delay(period);
}


/*
*********************************************************************************************************
*                                          GUI_X_ExecIdle()
*********************************************************************************************************
*/
void GUI_X_ExecIdle (void) 
{
    LTK_SysTick_Delay(1);
}

/*
*********************************************************************************************************
*                                    MULTITASKING INTERFACE FUNCTIONS
*
* Note(1): 1) The following routines are required only if uC/GUI is used in a true multi task environment, 
*             which means you have more than one thread using the uC/GUI API.  In this case the #define 
*             GUI_OS 1   needs to be in GUIConf.h
*********************************************************************************************************
*/

void  GUI_X_InitOS (void)
{
    dispSem = xSemaphoreCreateMutex();
    vSemaphoreCreateBinary( dispBinarySem );
}


void  GUI_X_Lock (void)
{
    xSemaphoreTake(dispSem, portMAX_DELAY);
}


void  GUI_X_Unlock (void)
{ 
    xSemaphoreGive(dispSem);
}


U32  GUI_X_GetTaskId (void) 
{
    return (uint32_t)uxTaskGetTaskNumber(NULL);
}

void GUI_X_WaitEvent(void)
{
    xSemaphoreTake(dispBinarySem, portMAX_DELAY);
}

void GUI_X_SignalEvent(void)
{
    xSemaphoreGive(dispBinarySem);
}

void GUI_X_Init (void) 
{
}

void GUI_X_Log(const char *s) 
{ 
    GUI_USE_PARA(s); 
}

void GUI_X_Warn(const char *s) 
{
    GUI_USE_PARA(s); 
}

void GUI_X_ErrorOut(const char *s)
{ 
    GUI_USE_PARA(s); 
}


/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */  
    
/****************************** leitek.taobao.com *****************************/

